fixture/vcr_cassettes/payment_test/get.json

[
  {
    "request": {
      "body": "",
      "headers": {
        "Authorization": "***",
        "Content-Type": "application/json",
        "Locale": "en",
        "Paidy-Version": "2016-07-01",
        "User-Agent": "Paidy/2016-07-01 paidy/0.1.0"
      },
      "method": "get",
      "options": {
        "recv_timeout": 80000,
        "connect_timeout": 30000
      },
      "request_body": "",
      "url": "https://api.paidy.com/payments/pay_WXURAD4AACEA1Gj3"
    },
    "response": {
      "body": "{\"id\":\"pay_WXURAD4AACEA1Gj3\",\"created_at\":\"2017-07-23T21:11:28.090Z\",\"expires_at\":\"2017-08-22T21:11:28.095Z\",\"amount\":12500,\"currency\":\"JPY\",\"description\":\"hoge\",\"store_name\":\"Live Shop! (Paidy sample store)\",\"test\":true,\"status\":\"authorized\",\"buyer\":{\"name1\":\"山田　太郎\",\"name2\":\"ヤマダ　タロウ\",\"email\":\"successful.payment@paidy.com\",\"phone\":\"818000000001\"},\"order\":{\"tax\":300,\"shipping\":200,\"order_ref\":\"your_order_ref\",\"items\":[{\"id\":\"PDI001\",\"title\":\"Paidyスニーカー\",\"description\":\"Paidyスニーカー\",\"unit_price\":12000,\"quantity\":1}],\"updated_at\":null},\"shipping_address\":{\"line1\":\"AXISビル 10F\",\"line2\":\"六本木4-22-1\",\"city\":\"東京都\",\"state\":\"港区\",\"zip\":\"106-2004\"},\"captures\":[],\"refunds\":[],\"metadata\":{}}",
      "headers": {
        "Content-Type": "application/json",
        "Date": "Sun, 23 Jul 2017 21:11:29 GMT",
        "Paidy-Version": "2016-07-01",
        "Request-Id": "req_Y2NlNGQyNzZhZmRkNDdjODkxMjliNmQ1ZmE1NjhiN2U=",
        "Server": "nginx/1.10.3 (Ubuntu)",
        "Content-Length": "747",
        "Connection": "keep-alive"
      },
      "status_code": 200,
      "type": "ok"
    }
  }
]