fixture/vcr_cassettes/payment_test/setup.json

[
  {
    "request": {
      "body": "{\"token_id\":\"TOKEN_PLACEHOLDER\",\"store_name\":\"Paidy sample store\",\"shipping_address\":{\"zip\":\"106-2004\",\"state\":\"港区\",\"line2\":\"六本木4-22-1\",\"line1\":\"AXISビル 10F\",\"city\":\"東京都\"},\"order\":{\"tax\":300,\"shipping\":200,\"order_ref\":\"your_order_ref\",\"items\":[{\"unit_price\":12000,\"title\":\"Paidyスニーカー\",\"quantity\":1,\"id\":\"PDI001\",\"description\":\"Paidyスニーカー\"}]},\"metadata\":{},\"description\":\"hoge\",\"currency\":\"JPY\",\"buyer_data\":{\"order_count\":1000,\"ltv\":250000,\"last_order_at\":20,\"last_order_amount\":20000,\"age\":29},\"amount\":12500}",
      "headers": {
        "Authorization": "***",
        "Content-Type": "application/json",
        "Locale": "en",
        "Paidy-Version": "2016-07-01",
        "User-Agent": "Paidy/2016-07-01 paidy/0.1.0"
      },
      "method": "post",
      "options": {
        "recv_timeout": 80000,
        "connect_timeout": 30000
      },
      "request_body": "",
      "url": "https://api.paidy.com/payments"
    },
    "response": {
      "body": "{\"id\":\"pay_WnhU4EwAAGMABMwv\",\"created_at\":\"2018-02-05T12:58:08.028Z\",\"expires_at\":\"2018-03-07T12:58:08.040Z\",\"amount\":12500,\"currency\":\"JPY\",\"description\":\"hoge\",\"store_name\":\"Live Shop! (Paidy sample store)\",\"test\":true,\"status\":\"authorized\",\"tier\":\"classic\",\"buyer\":{\"name1\":\"山田　太郎\",\"name2\":\"ヤマダ　タロウ\",\"email\":\"successful.payment@paidy.com\",\"phone\":\"818000000001\"},\"order\":{\"tax\":300,\"shipping\":200,\"order_ref\":\"your_order_ref\",\"items\":[{\"id\":\"PDI001\",\"title\":\"Paidyスニーカー\",\"description\":\"Paidyスニーカー\",\"unit_price\":12000,\"quantity\":1}],\"updated_at\":null},\"shipping_address\":{\"line1\":\"AXISビル 10F\",\"line2\":\"六本木4-22-1\",\"city\":\"東京都\",\"state\":\"港区\",\"zip\":\"106-2004\"},\"captures\":[],\"refunds\":[],\"metadata\":{}}",
      "headers": {
        "Content-Type": "application/json",
        "Date": "Mon, 05 Feb 2018 12:58:08 GMT",
        "Paidy-Version": "2016-07-01",
        "Request-Id": "req_OGIxNGJjNzY4M2VjNGYyMGI3NGE0MmY2YzIzMmIzZDc=",
        "Server": "nginx/1.10.3 (Ubuntu)",
        "Content-Length": "764",
        "Connection": "keep-alive"
      },
      "status_code": 200,
      "type": "ok"
    }
  }
]